tutorials/fsi/squareFlap/fluid/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-13;
        relTol           1.0e-2;
    };

    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-13;
    };
}

PIMPLE
{
    tolerance 1.0e-12;
    relTol 1.0e-6;
    maxIter 10;
    minIter 1;
    nCorrectors 10;
    nNonOrthogonalCorrectors 0;
    pisoTol 1.0e-3;
}

relaxationFactors
{
    U 0.9;
    p 0.9;
}

// ************************************************************************* //
